package main

import "fmt"

func main() {
	//1、练习：打印 0-50 所有的偶数
	for i := 0; i <= 50; i++ {
		if i%2 == 0 {
			fmt.Println(i)
		}
	}

	//2、练习：求 1+2+3+4 +...100 的和
	/*
		sum += sum+1   0+1

		sum += sum+2   0+1+2

		sum += sum+3   0+1+2+3

		sum += sum+4   0+1+2+3+4
	*/
	sum := 0
	for i := 1; i <= 100; i++ {
		sum += i
	}
	fmt.Println(sum) // 5050

	//3、练习：打印 1~100 之间所有是 9 的倍数的整数的个数及总和
	count := 0
	numSum := 0
	for i := 1; i <= 100; i++ {
		if i%9 == 0 {
			fmt.Println(i)
			count++
			numSum += i
		}
	}
	fmt.Printf("count=%d,numSum=%d\n", count, numSum) // count=11,numSum=594

	//4、练习：计算 5 的阶乘 (12345 n 的阶乘 12……n)   1*2*3*4*5
	/*
		1、sum=1*1
		2、sum=sum*2   1*1*2
		3、sum=sum*3   1*1*2*3
		4、sum=sum*4   1*1*2*3*4
		5、sum=sum*5   1*1*2*3*4*5
	*/
	var n = 1
	for i := 1; i <= 5; i++ {
		n *= i
	}
	fmt.Println(n) // 120

	//5、练习： 打印一个矩形 (for循环的嵌套)
	/*
		$$$$
		$$$$
		$$$$
	*/

	for i := 1; i <= 12; i++ {
		fmt.Print("$")
		if i%4 == 0 {
			fmt.Println("")
		}
	}

	//6、for循环的嵌套
	/*
		^^^^
		^^^^
		^^^^
	*/
	/*
		for循环嵌套的一个执行流程
		1、i=1   打印4个^   一个换行
		2、i=2   打印4个^   一个换行
		3、i=3   打印4个^   一个换行
		4、i=4  跳出循环
	*/

	for i := 1; i <= 3; i++ {
		for j := 1; j <= 4; j++ {
			fmt.Print("^")
		}
		fmt.Println("")
	}

	//7、练习： 打印一个三角形
	/*
		&
		&&
		&&&
		&&&&
		&&&&&
	*/
	var row = 5
	for i := 1; i <= row; i++ {
		for j := 1; j <= i; j++ {
			fmt.Print("&")
		}
		fmt.Println("")
	}

	// 8、练习：打印出九九乘法表
	/*
		1*1=1
		2*1=2 2*2=4
		3*1=3 3*2=6 3*3=9
		4*1=4 4*2=8 4*3=12 4*4=16
		5*1=5 5*2=10 5*3=15 5*4=20 5*5=25
		6*1=6 6*2=12 6*3=18 6*4=24 6*5=30 6*6=36
		7*1=7 7*2=14 7*3=21 7*4=28 7*5=35 7*6=42 7*7=49
		8*1=8 8*2=16 8*3=24 8*4=32 8*5=40 8*6=48 8*7=56 8*8=64
		9*1=9 9*2=18 9*3=27 9*4=36 9*5=45 9*6=54 9*7=63 9*8=72 9*9=81
	*/
	for i := 1; i <= 9; i++ {
		for j := 1; j <= i; j++ {
			fmt.Printf("%v*%v=%v ", i, j, i*j)
		}
		fmt.Println("")
	}
}
